
            Input: Inpainted depth, subtracted mean, in meters, with random rotations and zoom. 
            Output: Pos, cos(2theta), sin(2theta), grasp_width in pixels.
            Dataset: /home/douglas/dev/ae_grasp_prediction/data/datasets/dataset_rotated_width_zoom_171219_1516.hdf5
            Filter Sizes: [(9, 9), (5, 5), (3, 3)]
            No Filters: [32, 16, 8]
        

____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 300, 300, 1)   0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 100, 100, 32)  2624        input_1[0][0]                    
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 50, 50, 16)    12816       conv2d_1[0][0]                   
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 25, 25, 8)     1160        conv2d_2[0][0]                   
____________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTransp (None, 50, 50, 8)     584         conv2d_3[0][0]                   
____________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTransp (None, 100, 100, 16)  3216        conv2d_transpose_1[0][0]         
____________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTransp (None, 300, 300, 32)  41504       conv2d_transpose_2[0][0]         
____________________________________________________________________________________________________
pos_out (Conv2D)                 (None, 300, 300, 1)   129         conv2d_transpose_3[0][0]         
____________________________________________________________________________________________________
cos_out (Conv2D)                 (None, 300, 300, 1)   129         conv2d_transpose_3[0][0]         
____________________________________________________________________________________________________
sin_out (Conv2D)                 (None, 300, 300, 1)   129         conv2d_transpose_3[0][0]         
____________________________________________________________________________________________________
width_out (Conv2D)               (None, 300, 300, 1)   129         conv2d_transpose_3[0][0]         
====================================================================================================
Total params: 62,420
Trainable params: 62,420
Non-trainable params: 0
____________________________________________________________________________________________________
